class a:
	def printa(self):
		print('您有一封挂号信，请查收.\n谢谢,谁寄的啊?\n嗯……好像是你未来的男朋友.\n亲爱的未来女友:\n你好啊,我是你未来的男朋友.\n一直很想偷偷给你写封信,但又怕这样有点矫情,毕竟我还没遇到你.\n这封信我想了很久,写了很久,希望你能收到.\n最近跟朋友吃饭,他们问我怎么还不恋爱,我>    随口回了句:\n急啥,他爱来不来.\n嗯……其实我撒谎了.\n我从没告诉任何人,其实我已经等你很久了.\n最近,我身边的朋友们纷纷都脱了单.\n放假时,我参加了朋友的婚礼.\n作为伴郎,跟着他忙前忙后,看着他起个大早就开始忙,饿    了一天没喝口水,被折腾得精疲力尽,觉得——\n结婚真的好麻烦啊.\n可在婚礼的音乐声中,看着女方的她被眼里含泪的父亲牵着手,送到掩饰不了笑意的新郎面前.\n他们牵手,拥抱,接吻,一起说出那句:\n我愿意.\n突然好想恋爱啊,>    什么时候才能遇到你呢?\n我常常在想,你到底是一个怎样的人呢?\n个子有多高?胖还是瘦?喜欢笑吗?还是人前冷漠,唯独在我面前话很多?\n世界杯你支持的是哪一支球队?你看球时会激动到大喊大叫吗?\n你喜欢收集各种款式和牌>    子的球鞋吗?是不是和我收集球鞋一样,总是缺少下一双?\n虽然不是很能了解这些东西的乐趣,但是只要你喜欢就好啊.\n我相信你就快出现了.\n平时看到一些撩人套路时,我都会想,要是我有个女朋友就好啦,可以拿去撩她.\n最近,    我开始偷偷收藏看到的100句土味情话,25句遇到你时适合说的开场白,36种暗示喜欢你的方式,5种责备你姗姗来迟的小惩罚……\n我应该能做好你的男朋友吧,等你来检验哦.\n我现在一个人努力生活,过得还不错.\n在经过有些辛苦的    尝试后,终于找到了自己喜欢做的事情.\n尽管学习工作很累,也在尽量照顾好自己,一天三餐没有落下.\n在陌生的城市一个人漂着,偶尔去看展,逛公园,渐渐爱上了这座城市.\n好像……越来越习惯单身.\n可总有那么一些瞬间,让我很    想恋爱.\n一个人逛商场,却被情侣和三口之家包围的时候.\n取得了成绩,兴奋到极致却发现无人分享的时候.\n委屈到想发朋友圈,想了下最后却又删掉的时候.\n我早已学会如何享受一个人的快乐.\n关于两个人在一起的开心,我想    等你来一起体验.\n我这个人有点矛盾.\n有时候羡慕恋爱的美好,嚷嚷着要赶快恋爱.\n但真的有朋友介绍时,却又怂了,立刻退缩.\n所以,可不可以拜托你——\n如果你提前发现了我,跟我提示的明显一点吧.\n如果我明明很喜欢却莫>    名怂了,请不要轻易放弃.\n如果有天我们都为爱受过伤,可不可以再勇敢一些.\n我知道,生活有时蛮辛苦.\n你是否也曾受过伤,流过泪?失望过,沮丧过?')
class b:
	def printb(self):
		print('但这个宇宙的众多哀苦中,总归还是有一星半点的可爱的.\n希望我是你想要的那一点可爱.\n夏天到了,白昼渐长,日暮渐短.\n我仔细想过了,这个夏天最适合遇见你.\n我们可以一起去吃甜筒,不知道第二个半价的滋味尝起来会不会不一样.\n我们可以一起去海边,我的防晒霜给你擦,遮阳伞给你撑,防水眉笔给你用.\n不想出门的话,我们就宅在房间里,空调吹得凉飕飕,一起玩游戏.用水果和冷饮把冰箱塞满,一打开幸福感瞬间袭来.\n在网上读到段很甜的句子:\n跟我走吧,忐忑给你,情书给你,不眠的夜给你,四月的清晨给你,雪糕的第一口给你,手给你,怀抱给你,跋涉给你,等待给你,一腔孤勇和余生六十年,全都给你.\n今年夏天,又开始热起来了.\n可你知道吗?\n即使手掌出汗,我也想牵着你的手.\n即使身体发烫,我也想抱住你不放.\n我想跟你走.\n你来,我就把心交给你.\n  每天认真生活,同时偷偷想你的\n未来男朋友\n所以……你要不要做我女朋友?')
class c(a,b):
	def printc(self):
		print('c')
lao = c()
lao.printa()
lao.printb()
